[
    "What's the biggest secret you've kept from your best friend?",
    "If you could erase one memory, what would it be?",
    "What's the most embarrassing thing you've ever done?",
    "What would you do if you woke up as the opposite gender?",
    "Who was your first crush?",
    "What's the worst thing you've ever done?",
    "What's your biggest fear?",
    "What's the most childish thing you still do?",
    "What's your biggest regret?",
    "Who do you have a crush on right now?",
    "What's the meanest thing you've ever said to someone?",
    "What's your most embarrassing moment in school?",
    "What's the biggest lie you've ever told?",
    "What's your worst habit?",
    "What's something you're glad your parents don't know about you?",
    "Who in this room would you most like to kiss?",
    "What's the grossest thing you've ever done?",
    "What's your biggest insecurity?",
    "What's the most trouble you've ever been in?",
    "What's your guilty pleasure?",
    "Who do you think is the most attractive person in this room?",
    "What's the weirdest dream you've ever had?",
    "What would you do if you only had 24 hours to live?",
    "What's your most irrational fear?",
    "What's the worst date you've ever been on?",
    "What's something you do when you're alone that you wouldn't do in front of others?",
    "Who was your worst teacher and why?",
    "What's the most embarrassing thing your parents have caught you doing?",
    "What's your biggest pet peeve?",
    "What's the strangest thing you believed as a child?",
    "Who do you secretly dislike and why?",
    "What's the most embarrassing thing in your room right now?",
    "What's your weirdest talent?",
    "What's the dumbest thing you've ever done?",
    "Who would you least like to be stuck in an elevator with?",
    "What's your most embarrassing autocorrect fail?",
    "What's something you hope your parents never find out?",
    "What's the worst gift you've ever received?",
    "What's your biggest turn-off in a person?",
    "What's the most awkward situation you've ever been in?",
    "Who in your family are you most like?",
    "What's the worst thing you've done when you were angry?",
    "What's your most embarrassing nickname?",
    "What's something you pretend to like but actually hate?",
    "What's the weirdest thing you've ever eaten?",
    "Who do you stalk the most on social media?",
    "What's your most embarrassing fashion phase?",
    "What's the worst movie you pretend to like?",
    "What's something you're secretly proud of but embarrassed to admit?",
    "Who was your most embarrassing crush?",
    "What's the grossest habit you have?",
    "What's your biggest 'what if' in life?",
    "What's the most embarrassing thing you've done in front of your crush?",
    "What's your weirdest fear that most people don't have?",
    "What's the most childish thing that makes you cry?",
    "Who do you pretend to like but actually can't stand?",
    "What's your most embarrassing moment with technology?",
    "What's the weirdest thing you do when no one's watching?",
    "What's your biggest dating dealbreaker?",
    "What's the most embarrassing text you've sent to the wrong person?",
    "Who in this room do you trust the least?",
    "What's your most embarrassing moment at work/school?",
    "What's the weirdest thing you've Googled?",
    "What's your most irrational pet peeve?",
    "What's the most embarrassing thing you've done while drunk?",
    "Who do you think talks about you behind your back?",
    "What's your weirdest habit when you're stressed?",
    "What's the most embarrassing song on your playlist?",
    "What's your biggest turn-on that you're embarrassed about?",
    "Who do you wish you could switch lives with?",
    "What's the most embarrassing thing you've posted on social media?",
    "What's your weirdest recurring dream?",
    "What's something you judge people for but do yourself?",
    "What's your most embarrassing moment in public?",
    "Who do you think is overrated?",
    "What's the weirdest thing you've done for attention?",
    "What's your biggest hypocrisy?",
    "What's the most embarrassing thing you've done to get someone to like you?",
    "Who do you think has a crush on you but you're not interested?",
    "What's your weirdest deal-breaker in relationships?",
    "What's the most embarrassing thing you've done in front of your parents?",
    "What's your biggest unpopular opinion?",
    "Who in this room do you think will be most successful?",
    "What's your most embarrassing guilty pleasure TV show or movie?",
    "What's the weirdest thing you've done out of boredom?",
    "What's your biggest fear about the future?",
    "Who do you think is the most fake person you know?",
    "What's your most embarrassing moment with the opposite sex?",
    "What's the weirdest compliment you've ever received?",
    "What's your biggest regret from this past year?",
    "Who do you wish would ask you out?",
    "What's the most embarrassing thing you've done for money?",
    "What's your weirdest superstition?",
    "What's your biggest fear in relationships?",
    "Who do you think doesn't deserve their success?",
    "What's the most embarrassing thing you've done in a group chat?",
    "What's your weirdest turn-on?",
    "What's your biggest fear about growing up?",
    "Who do you think has the worst taste in the group?",
    "What's the most embarrassing thing you've googled about yourself?",
    "What's your weirdest insecurity?",
    "What's your biggest fear about your appearance?",
    "Who in this room would you never date and why?"
]
